import { FaRegClock, FaRegEnvelope } from "react-icons/fa6";
import { FiPhoneCall } from "react-icons/fi";
import { IoIosArrowBack } from "react-icons/io";
import { TfiHeadphone, TfiLocationPin } from "react-icons/tfi";
import ContactForm from "../features/Contact/ContactForm";
import Accordion from "../ui/Accordion";
import { useState } from "react";
const accordionData = [
  {
    id: 1,
    question: "شرایط استفاده از گارانتی به چه صورت است ؟",
    content: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
       چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع است.`,
  },
  {
    id: 2,
    question: "آیا امکان بازگشت کالا وجود دارد؟",
    content: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
       چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع است.`,
  },
  {
    id: 3,
    question: "برای خرید های بعدی نیاز به کد تخفیف دارم",
    content: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
       چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع است.`,
  },
  {
    id: 4,
    question: "شرایط استفاده از گارانتی به چه صورت هست؟",
    content: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
       چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع است.`,
  },
  {
    id: 5,
    question: "برای خرید های بعدی نیاز به کد تخفیف دارم",
    content: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
       چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع است.`,
  },
];
const ContactUs = () => {
  const [openAccordionId, setOpenAccordionId] = useState<number | null>(null);

  return (
    <div className="container xl:max-w-screen-xl mb-20 pl-4 pr-4 lg:pl-0 lg:pr-0">
      <div className="mb-28">
        <p className="mt-10 mb-5">تماس با ما</p>
        <div className="border rounded-xl">
          <div className="grid lg:grid-cols-2 p-4 gap-4">
            <div className="space-y-3">
              <ul className="p-2 ">
                <li className="flex items-center justify-between border-b p-2">
                  <span className="flex  items-center text-sm gap-1 pt-[7px] pb-[7px]">
                    <TfiLocationPin className="text-primary" />
                    دفتر مرکزی
                  </span>
                  <span className="text-xs">
                    ایران - تهران - خیابان فردوسی کوچه نهم
                  </span>
                </li>

                <li className="flex items-center justify-between border-b p-2">
                  <span className="flex  items-center text-sm gap-1 pt-[7px] pb-[7px]">
                    <FaRegEnvelope className="text-primary" />
                    ایمیل
                  </span>
                  <span className="text-xs">info@example.com</span>
                </li>

                <li className="flex items-center justify-between border-b p-2">
                  <span className="flex  items-center text-sm gap-1 pt-[7px] pb-[7px]">
                    <FiPhoneCall className="text-primary" />
                    شماره تماس فروش
                  </span>
                  <span className="text-xs">021-55665566</span>
                </li>

                <li className="flex items-center justify-between border-b p-2">
                  <span className="flex  items-center text-sm gap-1 pt-[7px] pb-[7px]">
                    <TfiHeadphone className="text-primary" />
                    شماره تماس پشتیبانی
                  </span>
                  <span className="text-xs">021-55665566</span>
                </li>

                <li className="flex items-center justify-between border-b p-2">
                  <span className="flex  items-center text-sm gap-1 pt-[7px] pb-[7px]">
                    <FaRegClock className="text-primary" />
                    ساعت پاسخگویی
                  </span>
                  <span className="text-xs">شنبه تا پنجشنبه 24 ساعته</span>
                </li>
              </ul>
              <div className="flex justify-around cursor-pointer ">
                <div className="flex flex-col items-center  gap-2 text-xs group">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="22"
                    height="22"
                    viewBox="0 0 22 22"
                    fill="none"
                    className="group-hover:scale-[0.8] transition-all ease-in-out duration-300"
                  >
                    <path
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M20.1639 10.9999C20.1639 16.0625 16.0598 20.1666 10.9972 20.1666C5.93462 20.1666 1.83057 16.0625 1.83057 10.9999C1.83057 5.93731 5.93462 1.83325 10.9972 1.83325C16.0598 1.83325 20.1639 5.93731 20.1639 10.9999ZM11.3257 8.60049C10.4341 8.97134 8.65219 9.73889 5.97992 10.9032C5.54598 11.0757 5.31867 11.2445 5.29798 11.4096C5.263 11.6886 5.61235 11.7984 6.08807 11.948C6.15278 11.9684 6.21983 11.9894 6.28856 12.0118C6.7566 12.1639 7.38619 12.3419 7.71349 12.349C8.01037 12.3554 8.34174 12.233 8.70757 11.9818C11.2044 10.2964 12.4932 9.4445 12.5741 9.42613C12.6312 9.41318 12.7103 9.39689 12.7639 9.44453C12.8175 9.49217 12.8122 9.58239 12.8066 9.60659C12.772 9.75413 11.4006 11.029 10.691 11.6888C10.4698 11.8945 10.3128 12.0404 10.2808 12.0737C10.2089 12.1483 10.1357 12.2189 10.0653 12.2868C9.63045 12.7059 9.30438 13.0203 10.0833 13.5336C10.4576 13.7803 10.7572 13.9842 11.056 14.1877C11.3824 14.41 11.7079 14.6317 12.129 14.9077C12.2363 14.9781 12.3388 15.0511 12.4386 15.1223C12.8184 15.393 13.1596 15.6363 13.5811 15.5975C13.8261 15.575 14.0791 15.3446 14.2076 14.6577C14.5113 13.0343 15.1082 9.5168 15.2461 8.06733C15.2582 7.94034 15.243 7.77781 15.2308 7.70647C15.2186 7.63512 15.1931 7.53347 15.1004 7.45822C14.9905 7.36911 14.821 7.35031 14.7451 7.35159C14.4004 7.35772 13.8714 7.54165 11.3257 8.60049Z"
                      stroke="#595959"
                      strokeWidth="1.2"
                      strokeLinejoin="round"
                    ></path>
                  </svg>
                  <span>تلگرام</span>
                </div>
                <div className="flex flex-col items-center  gap-2 text-xs group">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    className="group-hover:scale-[0.8] transition-all ease-in-out duration-300"
                  >
                    <path
                      d="M22 5.9246C21.2645 6.25051 20.4744 6.47071 19.6438 6.57025C20.4911 6.06289 21.1412 5.25782 21.4477 4.29948C20.655 4.76984 19.7768 5.1116 18.8422 5.29481C18.0935 4.49855 17.0277 4 15.8474 4C13.582 4 11.7446 5.8374 11.7446 8.10464C11.7446 8.42526 11.7816 8.73707 11.8503 9.03832C8.43883 8.86656 5.41672 7.23263 3.39258 4.75046C3.04025 5.35823 2.83766 6.06289 2.83766 6.81335C2.83766 8.23677 3.56258 9.4937 4.66273 10.2292C3.98978 10.2072 3.35735 10.0231 2.80419 9.71567V9.76852C2.80419 11.7565 4.21792 13.4151 6.09583 13.7921C5.75055 13.8855 5.38853 13.9348 5.01506 13.9348C4.75081 13.9348 4.49273 13.9102 4.24258 13.8626C4.76491 15.4921 6.27993 16.6795 8.07593 16.7112C6.67101 17.8122 4.90144 18.4684 2.97948 18.4684C2.64829 18.4684 2.3215 18.449 2 18.4112C3.81626 19.5765 5.97252 20.2547 8.28909 20.2547C15.8378 20.2547 19.9644 14.0026 19.9644 8.58029C19.9644 8.40412 19.96 8.2262 19.9521 8.05003C20.7536 7.47045 21.4495 6.74905 21.9982 5.92724L22 5.9246Z"
                      stroke="#595959"
                      strokeWidth="1.2"
                      strokeLinejoin="round"
                    ></path>
                  </svg>
                  <span>توییتر </span>
                </div>
                <div className="flex flex-col items-center  gap-2 text-xs group">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="22"
                    height="22"
                    viewBox="0 0 22 22"
                    fill="none"
                    className="group-hover:scale-[0.8] transition-all ease-in-out duration-300"
                  >
                    <path
                      d="M2.80656 6.64084C2.84943 5.70401 2.99612 5.09981 3.19449 4.58693L3.19716 4.57985C3.39374 4.05796 3.70169 3.58517 4.09958 3.1944L4.10516 3.18892L4.11065 3.18333C4.50174 2.78494 4.97469 2.47729 5.49613 2.28123L5.50512 2.27779C6.01682 2.07879 6.61985 1.93265 7.55746 1.88979M2.80656 6.64084C2.76149 7.6418 2.75 7.95208 2.75 10.5473C2.75 13.1432 2.76085 13.4528 2.80653 14.4539M2.80656 6.64084L2.80656 6.89333M3.19798 16.5153C3.39404 17.0367 3.70168 17.5097 4.10008 17.9008L4.10566 17.9062L4.11113 17.9118C4.50192 18.3097 4.97472 18.6176 5.49662 18.8142L5.50441 18.8172C6.01658 19.0158 6.61989 19.162 7.55746 19.2049M3.19798 16.5153L3.19454 16.5063C2.99554 15.9946 2.8494 15.3916 2.80653 14.4539M3.19798 16.5153L3.18622 16.4534M2.80653 14.4539L2.82189 14.5348M2.80653 14.4539L2.80653 14.2008M3.18622 16.4534L2.82189 14.5348M3.18622 16.4534C3.03148 16.0446 2.87215 15.4742 2.82189 14.5348M3.18622 16.4534C3.19165 16.4677 3.19707 16.4819 3.20248 16.4958C3.39872 17.0248 3.70964 17.5038 4.11292 17.8984C4.50736 18.3016 4.98618 18.6125 5.51502 18.8087C5.93943 18.974 6.53744 19.1468 7.55731 19.1935C8.58654 19.2404 8.90452 19.2499 11.4641 19.2499C14.0236 19.2499 14.3419 19.2403 15.3711 19.1935C16.3922 19.1467 16.9896 18.973 17.4125 18.809C17.9416 18.6128 18.4207 18.3018 18.8153 17.8984C19.2184 17.504 19.5293 17.0252 19.7255 16.4964C19.8908 16.072 20.0635 15.4739 20.1103 14.4541C20.1571 13.4249 20.1667 13.1062 20.1667 10.5473C20.1667 7.98841 20.1571 7.66952 20.1103 6.6403C20.0632 5.61383 19.8879 5.01563 19.7231 4.59234C19.5077 4.03621 19.2345 3.61559 18.8146 3.19567C18.3955 2.77741 17.976 2.50406 17.4195 2.28842C16.9947 2.12234 16.3961 1.94812 15.3711 1.90114C15.282 1.89709 15.1982 1.89331 15.1178 1.8898M2.82189 14.5348C2.82047 14.5083 2.81913 14.4815 2.81789 14.4544C2.81383 14.3651 2.81005 14.2813 2.80653 14.2008M7.55746 1.88979C8.55865 1.84411 8.86882 1.83325 11.4641 1.83325C14.0593 1.83325 14.3693 1.84473 15.3703 1.8898M7.55746 1.88979L7.81059 1.88979M15.3703 1.8898L15.1178 1.8898M15.3703 1.8898C16.3073 1.93265 16.9116 2.07932 17.4245 2.27771L17.4316 2.28041C17.9534 2.47699 18.4262 2.78494 18.817 3.18283L18.8224 3.18836L18.828 3.19379C19.2259 3.58459 19.5338 4.0575 19.7302 4.57954L19.7336 4.58838C19.9326 5.10008 20.0788 5.7031 20.1216 6.64071M7.81059 1.88979L15.1178 1.8898M7.81059 1.88979C8.65838 1.85272 9.12696 1.84474 11.4641 1.84474C13.8014 1.84474 14.2699 1.85272 15.1178 1.8898M7.81059 1.88979C7.73013 1.8933 7.64626 1.89708 7.55704 1.90114C6.5359 1.94794 5.93859 2.12167 5.51569 2.2857C4.98456 2.48259 4.50387 2.79517 4.10846 3.20079C3.69245 3.61851 3.42015 4.03712 3.2052 4.59186C3.03911 5.01666 2.86485 5.61555 2.81788 6.64057C2.81383 6.72949 2.81006 6.81311 2.80656 6.89333M20.1216 14.4539C20.0788 15.3915 19.9326 15.9948 19.734 16.507L19.731 16.5148C19.5344 17.0367 19.2265 17.5095 18.8286 17.9003L18.823 17.9057L18.8175 17.9113C18.4264 18.3097 17.9535 18.6174 17.432 18.8134L17.423 18.8169C16.9113 19.0159 16.3083 19.162 15.3707 19.2049M2.80653 14.2008C2.76946 13.353 2.76148 12.8844 2.76148 10.5473C2.76148 8.2095 2.76946 7.74157 2.80656 6.89333M2.80653 14.2008L2.80656 6.89333M9.91422 14.289C10.4056 14.4926 10.9322 14.5973 11.4641 14.5973C12.5382 14.5973 13.5683 14.1706 14.3278 13.4111C15.0874 12.6516 15.5141 11.6214 15.5141 10.5473C15.5141 9.47321 15.0874 8.44308 14.3278 7.68356C13.5683 6.92404 12.5382 6.49735 11.4641 6.49735C10.9322 6.49735 10.4056 6.6021 9.91422 6.80563C9.42285 7.00916 8.97639 7.30748 8.60031 7.68356C8.22424 8.05963 7.92592 8.5061 7.72239 8.99747C7.51886 9.48883 7.4141 10.0155 7.4141 10.5473C7.4141 11.0792 7.51886 11.6058 7.72239 12.0972C7.92592 12.5886 8.22424 13.035 8.60031 13.4111C8.97639 13.7872 9.42285 14.0855 9.91422 14.289ZM8.59129 7.67454C9.3532 6.91262 10.3866 6.48459 11.4641 6.48459C12.5416 6.48459 13.575 6.91262 14.3369 7.67454C15.0988 8.43645 15.5268 9.46982 15.5268 10.5473C15.5268 11.6248 15.0988 12.6582 14.3369 13.4201C13.575 14.182 12.5416 14.6101 11.4641 14.6101C10.3866 14.6101 9.3532 14.182 8.59129 13.4201C7.82938 12.6582 7.40134 11.6248 7.40134 10.5473C7.40134 9.46982 7.82938 8.43645 8.59129 7.67454ZM17.8145 5.53869C17.8145 5.84709 17.692 6.14286 17.4739 6.36094C17.2559 6.57901 16.9601 6.70152 16.6517 6.70152C16.3433 6.70152 16.0475 6.57901 15.8294 6.36094C15.6114 6.14286 15.4889 5.84709 15.4889 5.53869C15.4889 5.23028 15.6114 4.93451 15.8294 4.71644C16.0475 4.49837 16.3433 4.37585 16.6517 4.37585C16.9601 4.37585 17.2559 4.49837 17.4739 4.71644C17.692 4.93451 17.8145 5.23028 17.8145 5.53869Z"
                      stroke="#595959"
                      strokeWidth="1.2"
                      strokeLinejoin="round"
                    ></path>
                  </svg>
                  <span>اینستاگرام </span>
                </div>
                <div className="flex flex-col items-center  gap-2 text-xs group">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="22"
                    height="22"
                    viewBox="0 0 22 22"
                    fill="none"
                    className="group-hover:scale-[0.8] transition-all ease-in-out duration-300"
                  >
                    <path
                      d="M20.1668 11.0001C20.1668 5.9375 16.0628 1.83345 11.0002 1.83345C5.93755 1.83345 1.8335 5.9375 1.8335 11.0001C1.8335 15.5755 5.18561 19.3677 9.56787 20.0554V13.6499H7.2404V11.0001H9.56787V8.98058C9.56787 6.68319 10.9364 5.41418 13.0303 5.41418C14.0332 5.41418 15.0822 5.59321 15.0822 5.59321V7.84907H13.9263C12.7876 7.84907 12.4325 8.55567 12.4325 9.28059V11.0001H14.9748L14.5684 13.6499H12.4325V20.0554C16.8147 19.3677 20.1668 15.5755 20.1668 11.0001Z"
                      stroke="#595959"
                      strokeWidth="1.2"
                      strokeLinejoin="round"
                    ></path>
                  </svg>
                  <span>فیسبوک </span>
                </div>
              </div>
            </div>
            <div>
              <iframe
                src="https://www.google.com/maps/embed?pb=!1m14!1m12!1m3!1d25919.207670443346!2d51.356607295129365!3d35.70405477191237!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!5e0!3m2!1sen!2sde!4v1719055327556!5m2!1sen!2sde"
                width="100%"
                height="337"
                style={{ border: 0 }}
                allowFullScreen={true}
                loading="lazy"
                referrerPolicy="no-referrer-when-downgrade"
                className="rounded-xl border-cl_border"
              ></iframe>
            </div>
          </div>
        </div>
      </div>
      <div className="rounded-xl bg-instagram bg-[top_center] bg-cover  bg-no-repeat  w-full pt-10 pb-10 pr-5 pl-5 mb-36">
        <div className="relative flex justify-center text-white font-bold items-center">
          <img
            src="https://theme.fullwp.ir/ecolive/home-10/wp-content/uploads/2023/03/mobile.png"
            className="absolute right-[-60px] "
            alt=""
          />
          <div className="p-3 flex items-center gap-3">
            <p>ما روزانه مطالب آموزشی جالب در اینستاگرام منتشر می‌کنیم!</p>
            <span className="bg-white rounded-full w-12 h-12 flex items-center justify-center cursor-pointer">
              <IoIosArrowBack className="text-black" />
            </span>
          </div>
          <img
            src="https://theme.fullwp.ir/ecolive/home-10/wp-content/uploads/2023/03/Instagram-1.png"
            className="absolute left-0 filter blur-sm "
            alt=""
          />
        </div>
      </div>
      <div className="grid  lg:grid-cols-2 gap-7">
        <ContactForm />
        <div className="flex flex-col gap-3">
          <p className="text-xl font-bold mb-7">شاید جواب سوال خود را اینجا بیابید</p>
          {accordionData.map((item) => (
            <Accordion
              key={item.id}
              id={item.id}
              openAccordionId={openAccordionId}
              setOpenAccordionId={setOpenAccordionId}
              question={item.question}
              content={item.content}
            />
          ))}
        </div>
      </div>
    </div>
  );
};

export default ContactUs;
